protogia/avr-descriptionfiles-4-nim/svd/ATmega64M1.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x0000003B</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>External Interrupt Sense Control 0 Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>External Interrupt Sense Control 1 Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC2</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC3</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flags</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>External Interrupt Request 3 Enable</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCICR</name>
          <description>Pin Change Interrupt Control Register</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIFR</name>
          <description>Pin Change Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Mask Register 0</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Mask Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK2</name>
          <description>Pin Change Mask Register 2</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK3</name>
          <description>Pin Change Mask Register 3</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
